/* No comment provided by engineer. */
"%@ %@ is currently the newest version available." = "%1$@ %2$@ เป็นเวอร์ชั่นใหม่ล่าสุดแล้ว";

/* No comment provided by engineer. */
"%@ %@ is currently the newest version available.\n(You are currently running version %@.)" = "%1$@ %2$@ เป็นเวอร์ชั่นใหม่ล่าสุดแล้ว\n(You are currently running version %3$@.)";

/* Description text for SUUpdateAlert when the update is downloadable. */
"%@ %@ is now available—you have %@. Would you like to download it now?" = "%1$@ %2$@ พร้อมให้ดาวน์โหลดแล้ว (คุณมีเวอร์ชั่น %3$@) ต้องการดาวน์โหลดเลยหรือไม่";

/* The download progress in a unit of bytes, e.g. 100 KB */
"%@ downloaded" = "ดาวน์โหลด %@ เสร็จสิ้น";

/* The download progress in units of bytes, e.g. 100 KB of 1,0 MB */
"%@ of %@" = "%1$@ จาก %2$@";

/* Description text for SUUpdateAlert when the update has already been downloaded and ready to install. */
"%1$@ %2$@ has been downloaded and is ready to use! Would you like to install it and relaunch %1$@ now?" = "%1$@ %2$@ ได้ถูกดาวน์โหลดและพร้อมใช้งานแล้ว คุณต้องการติดตั้งและเริ่ม %1$@ ใหม่เดี๋ยวนี้หรือไม่";

/* No comment provided by engineer. */
"%1$@ can’t be updated, because it was opened from a read-only or a temporary location." = "%1$@ ไม่สามารถรับการอัพเดทได้เมื่อถูกเรียกจากดิสก์แบบอ่านอย่างเดียวหรือซีดีรอม ย้าย";

/* No comment provided by engineer. */
"A new version of %@ is available!" = "%@ มีเวอร์ชั่นใหม่!";

/* No comment provided by engineer. */
"A new version of %@ is ready to install!" = "เวอร์ชั่นใหม่ของ %@ พร้อมสำหรับการติดตั้งแล้ว";

/* No comment provided by engineer. */
"An error occurred in retrieving update information. Please try again later." = "เกิดข้อผิดพลาดระหว่างการรับข้อมูลอัพเดท กรุณาลองใหม่ในภายหลัง";

/* No comment provided by engineer. */
"An error occurred while downloading the update. Please try again later." = "เกิดข้อผิดพลาดระหว่างพยายามดาวน์โหลดอัพเดท กรุณาลองใหม่ในภายหลัง";

/* No comment provided by engineer. */
"An error occurred while extracting the archive. Please try again later." = "เกิดข้อผิดพลาดระหว่างการแตกไฟล์ที่ถูกบีบอัด กรุณาลองใหม่ในภายหลัง";

/* No comment provided by engineer. */
"An error occurred while parsing the update feed." = "เกิดข้อผิดพลาดระหว่างการประมวลผลฟีดอัพเดท กรุณาลองใหม่ในภายหลัง";

/* No comment provided by engineer. */
"Cancel" = "ยกเลิก";

/* No comment provided by engineer. */
"Cancel Update" = "ยกเลิกอัพเดท";

/* No comment provided by engineer. */
"Checking for updates…" = "ตรวจสอบอัพเดท…";

/* Take care not to overflow the status window. */
"Downloading update…" = "กำลังดาวน์โหลดอัพเดท…";

/* Take care not to overflow the status window. */
"Extracting update…" = "กำลังแตกไฟล์อัพเดท…";

/* No comment provided by engineer. */
"Install and Relaunch" = "ติดตั้งและเริ่มแอปพลิเคชันใหม่";

/* Take care not to overflow the status window. */
"Installing update…" = "กำลังติดตั้งอัพเดท…";

/* Alternate title for 'Install Update' button when there's no download in RSS feed. */
"Learn More…" = "เรียนรู้เพิ่มเติม…";

/* No comment provided by engineer. */
"OK" = "ตกลง";

/* No comment provided by engineer. */
"Ready to Install" = "พร้อมติดตั้ง";

/* No comment provided by engineer. */
"Should %1$@ automatically check for updates? You can always check for updates manually from the %1$@ menu." = "คุณต้องการให้ %1$@ ตรวจสอบอัพเดทโดยอัตโนมัติหรือไม่ คุณสามารถเริ่มการตรวจสอบอัพเดทด้วยตนเองได้ทุกเมื่อจากเมนูของ %1$@";

/* No comment provided by engineer. */
"Update Error!" = "อัพเดทผิดพลาด!";

/* No comment provided by engineer. */
"Updating %@" = "กำลังอัพเดท %@";

/* No comment provided by engineer. */
"Use Finder to copy %1$@ to the Applications folder, relaunch it from there, and try again." = "%1$@ ไปยังโฟลเดอร์แอปพลิเคชัน และเรียกใช้งาน จากนั้นลองใหม่อีกครั้ง";

/* Status message shown when the user checks for updates but is already current or the feed doesn't contain any updates. */
"You’re up to date!" = "คุณมีเวอร์ชั่นล่าสุดแล้ว!";

"%1$@ can’t be updated if it’s running from the location it was downloaded to." = "ลาก %1$@ ไปยังโฟลเดอร์ Applications ของคุณเพื่อเปิดใช้งานการอัปเดต";
